backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_4, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 96, 96, 3]
      dtype: float32
      name: input_4
      sparse: false
    inbound_nodes: []
    name: input_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_25
      padding: valid
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_4
        - 0
        - 0
        - {}
    name: conv2d_25
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7, 7]
      name: conv2d_28
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_4
        - 0
        - 0
        - {}
    name: conv2d_28
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_25
      padding: valid
      pool_size: &id003 !!python/tuple [2, 2]
      strides: *id003
      trainable: true
    inbound_nodes:
    - - - conv2d_25
        - 0
        - 0
        - {}
    name: max_pooling2d_25
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_28
      padding: valid
      pool_size: &id004 !!python/tuple [2, 2]
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - conv2d_28
        - 0
        - 0
        - {}
    name: max_pooling2d_28
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_26
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_25
        - 0
        - 0
        - {}
    name: conv2d_26
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_29
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_28
        - 0
        - 0
        - {}
    name: conv2d_29
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_26
      padding: valid
      pool_size: &id005 !!python/tuple [2, 2]
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - conv2d_26
        - 0
        - 0
        - {}
    name: max_pooling2d_26
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_29
      padding: valid
      pool_size: &id006 !!python/tuple [2, 2]
      strides: *id006
      trainable: true
    inbound_nodes:
    - - - conv2d_29
        - 0
        - 0
        - {}
    name: max_pooling2d_29
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_27
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_26
        - 0
        - 0
        - {}
    name: conv2d_27
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_30
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_29
        - 0
        - 0
        - {}
    name: conv2d_30
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_27
      padding: valid
      pool_size: &id007 !!python/tuple [2, 2]
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - conv2d_27
        - 0
        - 0
        - {}
    name: max_pooling2d_27
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_30
      padding: valid
      pool_size: &id008 !!python/tuple [2, 2]
      strides: *id008
      trainable: true
    inbound_nodes:
    - - - conv2d_30
        - 0
        - 0
        - {}
    name: max_pooling2d_30
  - class_name: Dropout
    config: {name: dropout_17, noise_shape: null, rate: 0.25, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_27
        - 0
        - 0
        - {}
    name: dropout_17
  - class_name: Dropout
    config: {name: dropout_18, noise_shape: null, rate: 0.25, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_30
        - 0
        - 0
        - {}
    name: dropout_18
  - class_name: Flatten
    config: {name: flatten_9, trainable: true}
    inbound_nodes:
    - - - dropout_17
        - 0
        - 0
        - {}
    name: flatten_9
  - class_name: Flatten
    config: {name: flatten_10, trainable: true}
    inbound_nodes:
    - - - dropout_18
        - 0
        - 0
        - {}
    name: flatten_10
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_4, trainable: true}
    inbound_nodes:
    - - - flatten_9
        - 0
        - 0
        - &id009 {}
      - - flatten_10
        - 0
        - 0
        - *id009
    name: concatenate_4
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_11
      trainable: true
      units: 512
      use_bias: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: dense_11
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_12
      trainable: true
      units: 40
      use_bias: true
    inbound_nodes:
    - - - dense_11
        - 0
        - 0
        - {}
    name: dense_12
  name: model_4
  output_layers:
  - [dense_12, 0, 0]
keras_version: 2.1.3
